//          ***Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).***

// let b = 0;

// for (let i = 20; i <= 30; i += 0.5) {
//   b = i;
//   console.log(b)
// }


//     ***Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.***

// let b = 27;

// for (let i = 10; i <=100; i +=10) {
//   console.log(b * i);
// }

//       ***Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.***


// let n = 5;

// for (let i = 1; i < 100; i++) {
//   if (i < n ** 2) {
//     console.log (i)
//   } else break;
// } 


// ***Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).***

// let n = 30;

// simpleNumber: //метка

// for (let i = 2; i < n; i++) {
//   for (let k =2; k < i; k++) {
//     if (i % k == 0) continue simpleNumber;
//   }
//   console.log(i)
// }

// ***Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна)***
// никак не могу понять как реализовать это
// let n = 15;

// for (let i = 1; i < n; i++) {
//   if (i % 3 == 0 ) {
//     console.log (i);
//   }
// } 

// let yourNumber = prompt('entar number');

// if (yourNumber % 3 == 0) {
//     console.log(`${yourNumber} can divide on 3`)
// } else {
//     console.log(`${yourNumber} can't divide on 3`)
// }